[
  {
    "title": "Portfolio",
    "src": "https://kuznietsova.org",
    "github": "https://github.com/acvetochka/portfolio",
    "technologies": ["Next JS", "React JS", "TypeScript", " Vercel"],
    "description": [
      "- Entwicklung einer persönlichen Website zur Präsentation professioneller Fähigkeiten, Projekte und Kontaktinformationen.​",
      "- Erstellung einer responsiven und interaktiven Benutzeroberfläche mit Next.js und React",
      "- Implementierung serverseitiger Funktionen zur Verarbeitung von Kontaktformularen und dynamischen Inhalten",
      "- Integration von Animationen und Styling mittels Styled-components Bibliotheke",
      "- Sicherstellung der Cross-Browser-Kompatibilität und Optimierung der Performance",
      "- Bereitstellung und Wartung der Website auf einem persönlichen Server",
      "Erfolge: Erzielung einer perfekten Punktzahl von 100 in allen Lighthouse-Kategorien."
    ],
    "date": ["Oktober 2024 - heute"]
  },
  {
    "title": "SmileBar",
    "src": "https://smile-bar.vercel.app/",
    "github": "https://github.com/SoftRyzen-internship/smile_bar",
    "technologies": [
      "Next JS",
      "React JS",
      "Tailwind CSS",
      " Sanity",
      "Telegram bot API"
    ],
    "description": [
      "Kommerzielles Teamprojekt von SoftRyzen. Rolle: Entwickler",
      "Mitarbeit bei der Entwicklung einer Website für ein professionelles Zahnaufhellungsstudio in Lwiw.​",
      "Verantwortlichkeiten:",
      "- Entwicklung der Abschnitte \"Vorteile\" und \"FAQ\" mit Tab-Funktionalität​",
      "- Gestaltung visueller Elemente, einschließlich Hintergründe und Animationen",
      "- Konfiguration von Stilen in der tailwind.config-Datei",
      "- Zusammenarbeit mit dem Team zur Lösung von Cross-Browser-Problemen und Optimierung des Interfaces."
    ],
    "date": ["November - Dezember 2023"]
  },
  {
    "title": "Car Rental",
    "src": "https://acvetochka.github.io/car-rental",
    "github": "https://github.com/acvetochka/car-rental",
    "technologies": [
      "React JS",
      " Redux Toolkit",
      " Axios",
      "Emotion Styles",
      "Framer Motion"
    ],
    "description": [
      "- Entwicklung einer Autovermietungs-Website mit benutzerfreundlicher Such- und Buchungsfunktion.​",
      "- Implementierung von Filtern nach Marke, Preis und Kilometerstand zur Erleichterung der Fahrzeugsuche",
      "- Entwicklung der Funktion zum Hinzufügen von Fahrzeugen zu Favoriten für zukünftige Buchungen",
      "- Sicherstellung eines responsiven Designs für optimale Darstellung auf verschiedenen Geräten"
    ],
    "date": ["Oktober - November 2023", "Februar 2024"]
  },
  {
    "title": "Goose Track",
    "src": "https://nazarmural.github.io/goose-track-project/",
    "github": "https://github.com/acvetochka/goose-track-project",
    "technologies": [
      "React JS",
      "Redux Toolkit",
      "Node.js",
      "Express.js",
      "MongoDB"
    ],
    "description": [
      "Teamprojekt. Rolle: Frontend Team Lead, Scrum Master, Entwickler.",
      "Entwicklung eines Veranstaltungskalender-Managementsystems mit Google-Authentifizierungsunterstützung.",
      "Verantwortlichkeiten:",
      "- Konfiguration der Projektstruktur​",
      "- Erstellung von Markup und Funktionalität für den Monatskalender",
      "- Als Scrum Master: Einrichtung und Verwaltung des Trello-Boards, Teilnahme an Meetings nach Agile-Methodik",
      "- Als Frontend-Teamleiter: Durchführung von Code-Reviews für 9 Frontend-Teammitglieder."
    ],
    "date": ["September - Oktober 2023"]
  },
  {
    "title": "Phonebook",
    "src": "https://acvetochka.github.io/Phonebook/",
    "github": "https://github.com/acvetochka/Phonebook",
    "technologies": [
      "React JS",
      "Redux Toolkit",
      "Axios",
      "Node.js",
      "Express",
      "MongoDB",
      "REST API",
      "DigitalOcean"
    ],
    "description": [
      "FullStack App",
      "Entwicklung einer voll funktionsfähigen Webanwendung zur Speicherung und Verwaltung von Telefonkontakten mit Benutzer-Authentifizierung.",
      "Verantwortlichkeiten:",
      "- Entwicklung des Frontends mit React zur Erstellung einer intuitiven Benutzeroberfläche",
      "- Erstellung des Backends mit Node.js zur Verarbeitung von Anfragen und Datenspeicherung",
      "- Bereitstellung des Backends auf einem DigitalOcean-Server zur Sicherstellung der Verfügbarkeit und Stabilität",
      "- Implementierung von Funktionen zum Hinzufügen, Löschen und Filtern von Kontakten nach Namen",
      "- Sicherstellung eines responsiven Designs für die korrekte Darstellung auf verschiedenen Geräten."
    ],
    "date": ["Juli - September 2023", "heute"]
  }
]
