[
  {
    "position": "Juristin",
    "company": "Rechtsabteilung des Staatlichen Notdienstes der Ukraine",
    "place": "Kiew, Ukraine",
    "date": "Oktober 2021 - Dezember 2021",
    "duties": [
      "Verwaltung von Dokumenten und Sicherstellung der Einhaltung von Verfahren bei der Einstellung und Entlassung von Mitarbeitern",
      "Bearbeitung von Unterlagen und Sicherstellung ihrer Einhaltung der Verfahrensnormen",
      "Analytische Arbeit, einschließlich der Überprüfung und Erstellung von Verträgen und Forderungen",
      "Zusammenarbeit mit staatlichen Systemen zur Überwachung von Fällen, wobei ich Erfahrung im Umgang mit Daten und systematisierten Prozessen (z. B. ЄСІТС, АСВП) gesammelt habe"
    ]
  },
  {
    "position": "Verantwortlicher Mitarbeiterin für die Bearbeitung schriftlicher und elektronischer Einsprüche",
    "date": "July 2021 - August 2021",
    "company": "Ukrposhta",
    "place": "Kiew, Ukraine",
    "duties": [
      "Behandlung von Beschwerden von natürlichen und juristischen Personen",
      "Verarbeitung von Anfragen von staatlichen und lokalen Behörden, Strafverfolgungs-, Justiz- und Regulierungsbehörden (Verwendung von Lotus Notes und dem elektronischen Dokumentenmanagementsystem IT-Enterprise)",
      "Verarbeitung von Anträgen von Anwälten"
    ]
  },
  {
    "position": "Leitender Angestellter von Postsicherung",
    "date": "April 2013 - July 2021",
    "company": "Ukrposhta",
    "place": "Kiew, Ukraine",
    "duties": [
      "Erstellung, Verwaltung und Pflege einer Datenbank von Straftaten, die von Dritten begangen wurden (im Excel-Programm)",
      "Analyse von Daten zu Straftaten im Bereich der Postkommunikation",
      "Kontrolle der Ergebnisse der Reaktion der Strafverfolgungs- und Justizbehörden auf Berichte über Straftaten im Tätigkeitsbereich des Unternehmens",
      "Analyse der Ergebnisse der Arbeit der Sicherheitsabteilungen in den Regionen",
      "Erstellung von Kriminalitätsberichten und analytischen Zertifikaten für das Ministerium für Infrastruktur der Ukraine"
    ]
  },
  {
    "position": "Bürokauffrau",
    "date": "Januar 2008 - April 2013",
    "company": "Inter TV Kanal",
    "place": "Kiew, Ukraine",
    "duties": [
      "Dokumentenmanagement",
      "Arbeit mit elektronischer Dokumentenverwaltung („Delo“, „Terrasoft“-Programme)"
    ]
  },
  {
    "position": "Dispatcherin",
    "date": "September 2007 - Januar 2008",
    "company": "Inter TV Kanal",
    "place": "Kiew, Ukraine",
    "duties": ["Eingehende und interne Anrufe empfangen und umleiten"]
  },
  {
    "position": "Kauffrau für Postdienstleistungen",
    "date": "September 2006 - September 2007",
    "company": "Ukrposhta",
    "place": "Kiew, Ukraine",
    "duties": [
      "Verarbeitung von ein- und ausgehenden Postsendungen und Geldüberweisungen",
      "Ausgabe von Renten und Geldleistungen",
      "Implementierung von Briefmarken, Gütern und Zeitschriften"
    ]
  },
  {
    "title": "Tetris",
    "src": "https://acvetochka.github.io/tetris/",
    "github": "https://github.com/acvetochka/tetris",
    "technologies": ["HTML", "CSS", "JS"],
    "description": [
      "- Entwicklung eines webbasierten Tetris-Spiels mit Implementierung der Kernmechaniken wie Blockbewegung, Kollisionsprüfung, Linienlöschung und einem dynamischen Punktesystem",
      "- Nachweis starker algorithmischer und problemlösungsorientierter Fähigkeiten durch effiziente Code-Strukturen und DOM-Manipulation",
      "- Integrierter Sound-Support mit der Möglichkeit, die Audioausgabe zu deaktivieren",
      "- Speicherung der Highscores im Local Storage"
    ],
    "date": ["Februar - März 2024"]
  },
  {
    "title": "Carp Travel",
    "src": "https://carp-travel-xi.vercel.app",
    "github": "https://github.com/acvetochka/carp-travel",
    "technologies": [
      "React JS",
      " Next JS",
      " Tailwind CSS",
      "Swiper",
      " Vercel"
    ],
    "description": [
      "- Entwicklung einer Landingpage für ein Unternehmen, das aktive Erholung in den Karpaten anbietet mit Next.js und React.",
      "- Erstellung eines responsiven Designs für optimale Darstellung auf verschiedenen Geräten",
      "- Integration von Slidern und Karussells mithilfe der Swiper-Bibliothek",
      "- Verwendung von Tailwind CSS für schnelle und effiziente Komponenten-Stylisierung",
      "- Bereitstellung und Wartung der Website auf der Vercel-Plattform."
    ],
    "date": ["September - Oktober 2023"]
  },
  {
    "title": "Booksheft",
    "src": "https://nazarmural.github.io/project-bookshelf/",
    "github": "https://github.com/NazarMural/project-bookshelf",
    "technologies": ["HTML", "SASS", "JS", "Parcel", "Rest API", "Firebase"],
    "description": [
      "Teamproject. Rolle: Entwickler. ",
      "Entwicklung einer Plattform zur Suche und zum Kauf von Büchern mit modernem, responsivem Design.",
      "Verantwortlichkeiten:",
      "- Entwicklung und Integration von Komponenten: Kategorie-Bücher, API-Anfragen, Loader, Footer und TeamModal",
      "- Zusammenarbeit mit dem Team über Trello zur Verfolgung von Aufgaben und Fortschritten",
      "- Teilnahme an Meetings zur Diskussion und Lösung technischer Fragen",
      "- Aktive Unterstützung bei Code-Reviews anderer Teammitglieder"
    ],
    "date": ["Mai 2023"]
  },
  {
    "title": "Mimino",
    "src": "https://acvetochka.github.io/mimino/",
    "github": "https://github.com/acvetochka/mimino/",
    "technologies": ["HTML", "SASS", "JS", "Parcel"],
    "description": [
      "Teamprojekt. Rolle: Team Lead, Entwickler.",
      "Leitete die Entwicklung einer responsiven Website für den Restaurant- und Hotelkomplex Mimino",
      "Verantwortlichkeiten:",
      "- Koordination eines Teams von 14 Entwicklern zur Sicherstellung der termingerechten Lieferung und Einhaltung der Projektziele",
      "- Entwurf und Implementierung der Website-Architektur unter Verwendung von HTML5, SASS und JavaScript",
      "- Integration von Drittanbieter-Bibliotheken wie Swiper-slider, nice-select, imask und aos-animation zur Verbesserung der Benutzererfahrung",
      "- Sicherstellung der Kompatibilität mit verschiedenen Geräten durch adaptive Layouts und Grafiken."
    ],
    "date": ["Januar - Februar 2023"]
  },
  {
    "title": "WebStudio",
    "src": "https://acvetochka.github.io/WebStudio/",
    "github": "https://github.com/acvetochka/WebStudio/",
    "technologies": ["HTML5", "SASS", "BEM", "JS"],
    "description": [
      "Einzelprojekt.Visitenkarten-Website.",
      "- Umsetzung eines responsiven Designs für optimale Darstellung auf verschiedenen Geräten",
      "- Anwendung der BEM-Methodik zur strukturierten Organisation des CSS-Codes",
      "- Optimierung der Gestaltung mithilfe von SASS zur Unterstützung der Skalierbarkeit",
      "- Integration interaktiver Elemente mit JavaScript zur Verbesserung der Benutzererfahrung."
    ],
    "date": ["November - Dezember 2022", "April 2023", "Juni 2024"]
  },
  {
    "description": "Qualifizierte Junior Frontend-Entwicklerin mit 2 Jahren praktischer Erfahrung in der Entwicklung von Webanwendungen. Versiert in HTML, CSS, JavaScript und TypeScript, mit Expertise in modernen Frameworks wie React, Next.js. Verfügt über grundlegende Kenntnisse in Backend-Technologien (Node.js, Express.js, MongoDB, RestAPI) und grundlegenden DevOps-Prinzipien. Tätig als Teamleiterin und Scrum Master, wodurch Führungs- und Organisationsfähigkeiten gestärkt wurden. Engagiert für kontinuierliche berufliche Weiterentwicklung und Optimierung von Geschäftsprozessen."
  }
]
