[
  {
    "title": "Portfolio",
    "src": "https://kuznietsova.org",
    "github": "https://github.com/acvetochka/portfolio",
    "technologies": [
      "Next JS",
      "React JS",
      "TypeScript",
      "Styled Components",
      " Vercel"
    ],
    "description": [
      "Developed a personal website to showcase professional skills, projects, and contact information.",
      "Responsibilities:",
      "- Created a responsive and interactive user interface using Next.js and React",
      "- Implemented server-side functions to handle contact forms and dynamic content",
      "- Integrated animations and styling with Styled-components libraries",
      "- Ensured cross-browser compatibility and optimized performance",
      "- Deployed and maintained the website on a personal server",
      "Achievements: Achieved a perfect score of 100 across all Lighthouse parameters"
    ],
    "date": ["October 2024 - today"]
  },
  {
    "title": "SmileBar",
    "src": "https://smile-bar.vercel.app/",
    "github": "https://github.com/SoftRyzen-internship/smile_bar",
    "technologies": [
      "Next JS",
      "React JS",
      " Tailwind CSS",
      " Sanity",
      "Telegram bot API"
    ],
    "description": [
      "Commercial team project by SoftRyzen. Role: Developer",
      "Participated in the development of a website for a professional teeth whitening studio in Lviv.​",
      "Responsibilities:",
      "- Developed the \"Advantages\" and \"FAQ\" sections with tab functionality​",
      "- Designed visual elements, including backgrounds and animations",
      "- Configured styles in the tailwind.config file",
      "- Collaborated with the team to resolve cross-browser issues and optimize the interface"
    ],
    "date": ["November - December 2023"]
  },
  {
    "title": "Car Rental",
    "src": "https://acvetochka.github.io/car-rental",
    "github": "https://github.com/acvetochka/car-rental",
    "technologies": [
      "React JS",
      " Redux Toolkit",
      " Axios",
      "Framer Motion",
      "Emotion Styles"
    ],
    "description": [
      "- Developed a car rental service website offering convenient search and booking functionalities",
      "- Implemented filters by brand, price, and mileage to facilitate car searches",
      "- Developed functionality for adding cars to favorites for future booking",
      "- Ensured responsive design for optimal display across various devices"
    ],
    "date": ["October - November 2023", "February 2024"]
  },
  {
    "title": "Goose Track",
    "src": "https://nazarmural.github.io/goose-track-project/",
    "github": "https://github.com/acvetochka/goose-track-project",
    "technologies": [
      "React JS",
      "Redux Toolkit",
      "Node.js",
      "Express.js",
      "MongoDB"
    ],
    "description": [
      "Team-project. Role: Frontend Team Lead, Scrum Master, Developer.",
      "Developed an event schedule management system with Google authentication support.",
      "Responsibilities:",
      "- Configured project structure.​",
      "- Created markup and functionality for the monthly calendar.​",
      "- As Scrum Master: set up and managed Trello board, participated in Agile methodology meetings.​",
      "- As Frontend Team Lead: conducted code reviews for 9 frontend team members."
    ],
    "date": ["September - October 2023"]
  },
  {
    "title": "Phonebook",
    "src": "https://acvetochka.github.io/Phonebook/",
    "github": "https://github.com/acvetochka/Phonebook",
    "technologies": [
      "React JS",
      "Redux Toolkit",
      "Axios",
      "Node.js",
      "Express",
      "MongoDB",
      "REST API",
      "DigitalOcean"
    ],
    "description": [
      "FullStack App",
      "Developed a full-featured web application for storing and managing phone contacts with user authentication",
      "Responsibilities:",
      "- Developed the frontend using React to create an intuitive user interface.",
      "- Created the backend with Node.js to handle requests and data storage",
      "- Deployed the backend on a DigitalOcean server to ensure availability and stability",
      "- Implemented functionality for adding, deleting, and filtering contacts by name",
      "- Ensured a responsive design for proper display on various devices."
    ],
    "date": ["July - September 2023", "today"]
  }
]
